app/views/users/show.html.erb

SELECT "pins".* FROM "pins"  WHERE "pins"."user_id" = ?  [["user_id", 2]]
---
<div id="pins" class="transitions-enabled">
  <% @user.pins.each do |pin| %>