app/controllers/users_controller.rb

def show
    @user = User.find(params[:user_id])
    @userpins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "pins"  WHERE "pins"."user_id" = ?  [["user_id", 2]]